 # group by pandas

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':"Sam Charlie Amy Vanessa Carl Sarah".split(),
       'Sales': [200,120,340,124,243,350]}

In [5]:
df = pd.DataFrame(data)

In [7]:
byComp = df.groupby('Company')

In [9]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [14]:
byComp.std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [16]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [19]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [20]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0